app/views/users/show.html.erb

  <strong>Country:</strong>
  <%= @user.location.country %>
---
SELECT  "locations".* FROM "locations" WHERE "locations"."id" = ? LIMIT 1  [["id", 1]]