app/controllers/locations_controller.rb

  def create
    @location = Location.new(location_params)

    respond_to do |format|
      if @location.save
---
INSERT INTO "locations" ("country", "city", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["country", "England"], ["city", "London"], ["created_at", "2015-08-04 15:59:53.779205"], ["updated_at", "2015-08-04 15:59:53.779205"]]