app/controllers/photos_controller.rb

INSERT INTO "photos" ("image", "description", "photographer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["image", "asdas"], ["description", "asdasd"], ["photographer_id", 1], ["created_at", "2015-08-05 08:46:02.866218"], ["updated_at", "2015-08-05 08:46:02.866218"]]
---
  def create
    @photo = Photo.new(photo_params)

    respond_to do |format|
      if @photo.save