app/controllers/users_controller.rb

INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "role", "phone_number", "country", "city", "currency", "price_for_2_hour_photoshoot", "upload_professional_photo", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new user_params
    respond_to do |format|
      if @user.save

UPDATE "users" SET "last_name" = ?, "role" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["last_name", "Turobov11"], ["role", ""], ["updated_at", "2015-08-05 13:07:18.668587"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @user.update(user_params)

DELETE FROM "users" WHERE "users"."id" = ?  [["id", 1]]
---
  def destroy
    session[:user_id] = nil
    @user.destroy